---
kind: method
id: M:Autodesk.Revit.DB.IFC.RoofComponents.GetPlaneDirections
source: html/973fe031-6986-03c7-add3-357a9303344d.htm
---
# Autodesk.Revit.DB.IFC.RoofComponents.GetPlaneDirections Method

The plane directions of roof slabs.

## Syntax (C#)
```csharp
public IList<XYZ> GetPlaneDirections()
```

## Returns
The directions.